 export const raceOriginTable =  {
	human: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "猟師",
						5: "学者",
							6: "職人",
								7: "農民",
									8: "商人",
										9: "兵士",
											10: "騎士",
												11: "神官",
													12: "貴族"
		}
	},
	dwarf: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "猟師",
						5: "商人",
							6: "亭主",
								7: "鍛冶師",
									8: "職人",
										9: "兵士",
											10: "盾砕き",
												11: "神官",
													12: "貴族"
		}
	},
	elf: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "半森人",
						5: "細工師",
							6: "兵士",
								7: "猟師",
									8: "詩人",
										9: "楽師",
											10: "語り部",
												11: "祈祷師",
													12: "族長"
		}
	},
	lizardman: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "奴隷",
						5: "騎兵",
							6: "工兵",
								7: "弓兵",
									8: "槍兵",
										9: "歩兵",
											10: "軍師",
												11: "司祭",
													12: "王卵"
		}
	},
	halfling: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "詩人",
						5: "学者",
							6: "職人",
								7: "農民",
									8: "商人",
										9: "亭主",
											10: "庭師",
												11: "騎士",
													12: "地主"
		}
	},
	darkElf: {
		origin1: {
			2: "冒険者",
				3: "異端者",
					4: "犯罪者",
						5: "密偵",
							6: "商家",
								7: "兵士",
									8: "拷問吏",
										9: "武人",
											10: "神官",
												11: "精霊使い",
													12: "貴種"
		}
	},
	martialBeastman: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "奴隷",
						5: "占い師",
							6: "労働者",
								7: "狩人",
									8: "傭兵",
										9: "兵士",
											10: "商人",
												11: "自然崇拝者",
													12: "族長"
		}
	},
	bruteBeastman: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "奴隷",
						5: "占い師",
							6: "労働者",
								7: "狩人",
									8: "傭兵",
										9: "兵士",
											10: "商人",
												11: "自然崇拝者",
													12: "族長"
		}
	},
	agileBeastman: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "奴隷",
						5: "占い師",
							6: "労働者",
								7: "狩人",
									8: "傭兵",
										9: "兵士",
											10: "商人",
												11: "自然崇拝者",
													12: "族長"
		}
	},
	sensoryBeastman: {
		origin1: {
			2: "冒険者",
				3: "無頼",
					4: "奴隷",
						5: "占い師",
							6: "労働者",
								7: "狩人",
									8: "傭兵",
										9: "兵士",
											10: "商人",
												11: "自然崇拝者",
													12: "族長"
		}
	}
}
// 経歴②・③は全種族共通
export const commonOriginTable = {
	origin2: {
		2: "奴隷",
			3: "牢獄",
				4: "戦場",
					5: "神殿",
						6: "孤児",
							7: "平穏",
								8: "貧困",
									9: "学校",
										10: "箱入り",
											11: "贅沢",
												12: "宮廷"
	},
	origin3: {
		2: "宿敵",
			3: "上司",
				4: "後輩",
					5: "取引相手",
						6: "部下",
							7: "家族",
								8: "親友",
									9: "先輩",
										10: "婚約者",
											11: "好敵手",
												12: "師匠"
	}
}